socialNetwork/wrk2/custom-scripts/outputs-without-istio/rps_20/0.txt
Running 1m test @ http://128.199.25.250:31111/wrk2-api/home-timeline/read
  2 threads and 100 connections
  Thread calibration: mean lat.: 114.980ms, rate sampling interval: 337ms
  Thread calibration: mean lat.: 47.813ms, rate sampling interval: 118ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    59.62ms   29.12ms 140.16ms   69.85%
    Req/Sec     9.95     49.55   330.00     95.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   56.67ms
 75.000%   75.07ms
 90.000%   99.84ms
 99.000%  140.16ms
 99.900%  158.21ms
 99.990%  158.72ms
 99.999%  158.72ms
100.000%  158.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      16.943     0.000000            1         1.00
      27.327     0.100000           99         1.11
      33.183     0.200000          199         1.25
      39.199     0.300000          296         1.43
      47.231     0.400000          394         1.67
      56.671     0.500000          493         2.00
      59.679     0.550000          542         2.22
      62.239     0.600000          591         2.50
      64.927     0.650000          641         2.86
      68.223     0.700000          692         3.33
      75.071     0.750000          739         4.00
      80.959     0.775000          764         4.44
      83.327     0.800000          788         5.00
      86.335     0.825000          813         5.71
      89.663     0.850000          839         6.67
      94.079     0.875000          862         8.00
      96.639     0.887500          875         8.89
      99.839     0.900000          887        10.00
     104.447     0.912500          899        11.43
     109.503     0.925000          912        13.33
     115.391     0.937500          924        16.00
     118.463     0.943750          930        17.78
     119.487     0.950000          937        20.00
     120.639     0.956250          942        22.86
     124.223     0.962500          949        26.67
     126.591     0.968750          956        32.00
     126.911     0.971875          958        35.56
     129.599     0.975000          961        40.00
     134.655     0.978125          964        45.71
     135.167     0.981250          967        53.33
     135.935     0.984375          970        64.00
     136.703     0.985938          972        71.11
     138.879     0.987500          973        80.00
     140.159     0.989062          975        91.43
     141.183     0.990625          976       106.67
     154.623     0.992188          978       128.00
     154.879     0.992969          979       142.22
     154.879     0.993750          979       160.00
     155.007     0.994531          980       182.86
     155.135     0.995313          981       213.33
     155.519     0.996094          982       256.00
     155.519     0.996484          982       284.44
     155.519     0.996875          982       320.00
     157.951     0.997266          983       365.71
     157.951     0.997656          983       426.67
     158.207     0.998047          984       512.00
     158.207     0.998242          984       568.89
     158.207     0.998437          984       640.00
     158.207     0.998633          984       731.43
     158.207     0.998828          984       853.33
     158.719     0.999023          985      1024.00
     158.719     1.000000          985          inf
#[Mean    =       59.624, StdDeviation   =       29.125]
#[Max     =      158.592, Total count    =          985]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1101 requests in 1.00m, 296.71KB read
  Socket errors: connect 0, read 0, write 0, timeout 1850
Requests/sec:     18.33
Transfer/sec:      4.94KB